//=============================================================================
// Проект:     Система мониторинга клиентского обслуживания (СиМКО)
// Файл:       DSocketI.h
// Назначение: Интерфейс взаимодействия модулей DServer и DClient
//-----------------------------------------------------------------------------
// Copyright (c) 2013, Нигматуллин Ф.Т.
//=============================================================================

#ifndef __DSOCKETI_H__
#define __DSOCKETI_H__

//----------------------------------------------------------------------------
// Сокет и имя для DServer
//----------------------------------------------------------------------------
#define DSOCKET_CS_DSOCKET 8085
#define DSOCKET_CS_DSERVER "DServer"

//----------------------------------------------------------------------------
// Команды управленя
//----------------------------------------------------------------------------

//----------------------------------------------------------------------------
// Коды возврата (первое число в параметре Out)
//----------------------------------------------------------------------------
// Операция выполнена успешно
#define DSOCKETCMD_OK                 0
// Если есть желание вернуть ошибку выполнения функции на стороне клиента
#define DSOCKETCMD_FAULT             -1
// Данных нет
#define DSOCKETCMD_NODATA             1
// Ошибка при выполнении команды
#define DSOCKETCMD_EXECERROR          2

#endif